laRhea BL
                          laRhea BL
rych. Mix                 laRhea V+
                          vloz
salek                          spojuji
prosim cekejte              Predvolba
- CUKR +                  vloz
salek                          ODEBERTE SALEK
PROSIM               pripravuji
napoj c§1                §1
pripravuji                       vlozit
presny obnos                 kontrola kavove
jednotky            Programming
OK                      chyba behem
PROG                    1= KEY ---> VMC
2= VMC ---> KEY     PROG
EPROM data                     PROG
RHEA FLASH------               produkt rezerva
§1                  vodni filter
cst. 10=START          stroj
pripraven                     servis
karta                        blokovano
----------------          mazani kava
grounds=RESET           reset coffee
grounds = P1            
                                  Platba:
§1                          MIMO PROVOZ
vodni filtr             MIMO PROVOZ
vycist. jednotku        cena : §1
                          MIMO PROVOZ
kavovy odpad            neni produkt
                       plnim vodu
cekejte                  cekejte
                            cekejte
teplota                     MIMO PROVOZ
OFF §1:§2               stroj vypnut
§1:§2                  ................
start v §1:§2      TEST VEND
                          chvilku
si odpocinte                cerstve
mleko                       zprava 3
programovatelny            doprejte si
prestavku               Vas
kavovy servis                   vloz mince
                         t. inst. §1
----------------        t.c §1 t.s §2
t.h §3                ctecka karet
nepripojeno            data audit
prosim cekejte           konvice
                            rheavendors
                        vloz
salek                          zadny vyber
C.Mlek OFF §1           stastne
hodiny                      zdarma
§1                           neni zrnkovakava
OFF §1             mes 48
                             MIMO PROVOZ
neni vod ----           plnim vodu
potvrd tlac 1            hydrodinamicka
vyprazdnovc faz      automaticke
cist. pary              servis
                             chyba na klici
kod §1               1-4=Mix 5=MilkMd
7=Gr 8=BC 9=Desc   1-4=oplach
7=Gr 8=BC 9=Desc         1-4=opl 5=Mleko
7=mlynek 8=BC       1-4=oplach
8=BC                     1-4=oplach
                         oplach §1
§2                        RFID ctck krt
pripojena             ahoj §1
§2-§3-§4 §5 §6:§7           vlozit presnou
castku               vymena
vodni filtr                  cisteni
kavove jednotky             vyprazdnit
kavovy odpad             NASTAV PRODUKT
---- OK ----         INSTALACE
                          konec
instalace                     platba = 0
                         prilozte
kartu                      vyber karty
                        reserva produktu
doplnit kavu       neni k dispozici
§1                 - C U K R +
                        vyberte si
svuj napoj               dverni modul
verse §1               preso modul
verse §1                modul mlk
verse §1                  pravidelne cst.
za §1 s              
OFF §1 §2                         ODEBERTE SALEK
Prosim               plnim
parni boiler                  neplatny kod
karty zakaznika        neplatny kod
karty automatu         stastny
vyber                       ZETONY
                             cekejte prosim
tpl. pary            Cena: §1
Platba: §2                 Prvni kava
v procesu                vyprazdnit
kavovy odpad             odkap.misku
vyjmout                 vlozit
odkapovou misku              para cst.
10=START                  napln cistic
mleka 10=START         plnim vodu
conduc.=§1 uS            napln vodu
10=START                 tepla voda
oplach 10=START          modul mlk
spojeno                   kontainer mlk
prazdny               S T O P
                            RFID karta
blokovana                Cappuccinator
prosim vycistit       cist. s
csticem 10=START            cyklicky test
kolo #§1              cyklicky test
STOP !!!!             cst. studenou
vodou 10=START        konec cst.
s cstcm prstr.           KONEC
cst. pary                     cekejte cist.
cappuccinatoru        umistete
salek                      nastaveni mlynku
Prosim cekejte     §1
horka vod                        varovani nizka
hladina produktu      
                                  chytit kavu
stiskni PROG             
autom. reset                      Konec
odinstalace                   Kon. Vysled:§1
zmackni <PROG>       Cas cisteni
mlekovace updat         test bezi
                          potvrd catecny
reset stk P10        start Test
4=start PROG=knc         TEST MOTOR - §1
sx §2 dx §3         TEST - §1 Tp: §2
up §3 dn §4        konecny vysledek
TEST - §1          system stat
prosim restart          vyprazdnete tank
na odpadni vodu    vlz nadobku
na odpadni vodu         oplach §1 §2
........uS=§3          Zkontrolovat hod
start 10           cst. roztok/tabl
10=Tab 12=Cistic   kontrola mlk
                       kontrola cistice
ve vodni smesi     modul mlk cistit
Zkontrl cist §1    cist.§1 §2
........uS=§3            rozpousteni
cistic §1 §2            vloz mlecnou
tubu.10:ted 9:ne       vlz hadicku cst
mlk 10:ted 9:ne     kontrola
pritomnost mleka           kontrola kvality
mleka              zkontr mleko
a provedte cst.        Gest. rhMM1.v+ ?
B1=povolit B2=ne   cst. rhMM1.v+
Cas §1:§2 Ok=P1       mlk modul cistit
malo cistice §1    kontrola teploty
studeneho mleka    k dispozici
                        zavrit kavu
stiskni <PROG>          otevri kavu
stiskni <PROG>          1/13 cst. mlynek
1=mlyn1; 2=mlyn2   2/13 G§1 zavrit
uzaver 10=ok        3/13odeber zasob
zrno 10=ok         4/13 vloz cist.
zarizeni 10=ok      5/13 mlynek
cist. 10=start          Cyklus §1 z §2
                     6/13opak. Cist.
10=ano ,jine=ne     7/13 ref.cist.
zarizeni 10=ok       8/13 vratit zpet
zas. zrno 10=ok    9/13otevri zas
zrno 10=ok           10/13 kavovy
mlynek 10=Start        Cyklus §1 z §2
pauza §3 sec         11/13opak.proces
10=ano;/=ne        12/13 vratte
presovku 10 = ok       13/13 kava ?
10=ano; /=ne           espresso
priprava                   nadchazejici
plan udrzby            udrzba musi byt
provedena           zadejte hmotnost
1 = ulozit §1      odeberte salek
prosim               mimo provoz
neni vod                vloz kelimek
a zavrete klapku       vyjmete
odkapovou misku             vloz
odkapovou misku                prosim uzavrete
klapku              capucinator
prosim vycistit         vloz
salek                          vlozte
presnou castku               kontrola kavove
jednotky            mimo provoz
vycist presovnku        ................
start v §1:§2      TEST VEND
                          Zrelaxuj se
dej si kavu             Cerstve
Mleko                       zprava 3
programovatelne            doprejte si
prestavku               Vas
kavovy servis                   vlz mince
                          vycistit
kavovou jednotku           vyprazdnit
kavovy odpad             KONEC PROG
cekejte …..              zadejte kod
BLOKOVANO               odinstalace
v procesu                
                                  KALIBRACE
NEMOZNA                   vyjmete presovku
stiskni PROG       vyjmete presovku
stiskni PROG       otevrete boiler
10=start            STISKNI
>PROG<                      konec odinstal
zavrit boiler        Voda pripojena?
start=10            odpadova nadob
uvnitr? 10=START     odpadova nadob
uvnitr? 10=START     odstranit kavovy
odpad 10=START     odpadova nadob
prazdn? Start=10     REGISTRACE
mimo provoz              REGISTRACE
mimo provoz              PROGRAMOVANI----
----------------   Predvyber
neobsazeno                PRODUKT §1
0=blok. §2.§3            Cas
mlynku §1 §2.§3                 Cas
mlynku §1 §2                    zad. hmot. §1
1=uloz 2=opak         Zad. ML vody
1=uloz 2=opk §1        vyprazd test kyb
test 1=ano 2=ne    Napln H2O FM nad
t.tube 1=ok 2=ne   potvrdit akci
10=ano 9=ne           1-4=Mix 5=MilkMd
8=BC 9=odvapnit    1-4=cist.
8=BC 9=odvapnit           1-4=opl 5=mlk
8=BC                  1-4=cist.
7=mlynek 8=BC             1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=odvp   1-4=Mix 5=MilkMd
6=DeM 8=BC 9=Des   1-4=opla 5=mlk
6=D.M 7=Gr. 8=BC     1-4=opl 5=mlk
6=cst. mlk 8=BC       uspora energie
                     Kredit:
Karta                       Prosim drzte
kred. kartu            KALIB. MLYNKU
NUTNA                 Refill   cups
                      Use own cups 
                      